# BAIS:3250 - Final Project
### Data Transformation

**Author(s):** Natalie Brown, Max Kaiser

**Date Modified:** 11-21-2024 (*date created:* 11-21-2024)


**Description:** Transforming columns and dropping / imputing nulls for final dataset

---

### Import Libaries
* **pandas:** for data frames and data cleaning functions

In [3]:
import pandas as pd

---
### Load Data
* **country_merged_clean.csv**

In [5]:
# load data
country_df=pd.read_csv('05_country_merged_clean.csv',sep=',',encoding='utf-8')

# display
country_df.head()

,country,birth_rt,currency_code,fertility_rt,infant_mortality_rt,life_expectancy,official_language,physicians_per_thousand,lat,long,...,primary_education_enrollment_pct,secondary_education_enrollment_pct,tax_revenue_pct,unemployment_rt,country_edited,continent,covid_cases,covid_deaths,total_area_km2,average_population
0,Afghanistan,32.49,AFN,4.47,47.9,64.5,Pashto,0.28,33.939110,67.709953,...,104.0,9.7,9.3,11.12,Afghanistan,Asia,46498,1774,652000,38673974
1,Albania,11.78,ALL,1.62,7.8,78.5,Albanian,1.20,41.153332,20.168331,...,107.0,55.0,18.6,12.33,Albania,Europe,37625,798,28748,2865340
2,Algeria,24.28,DZD,3.02,20.1,76.7,Arabic,1.72,28.033886,1.659626,...,109.9,51.4,37.2,11.70,Algeria,Africa,83199,2431,2381741,43621542
3,Andorra,7.20,EUR,1.27,2.7,NaN,Catalan,3.33,42.506285,1.521801,...,106.4,NaN,NaN,NaN,Andorra,Europe,6712,76,468,77230
4,Angola,40.73,AOA,5.52,51.6,60.8,Portuguese,0.21,-11.202692,17.873887,...,113.5,9.3,9.2,6.89,Angola,Africa,15139,348,1246620,32569069

---
### Null Display
* determine how many nulls are in each column, should they be imputed or dropped?
    * we will look up data for nulls on WHO website and create a map to impute (world health organization) and other various reputable sources
* nulls columns:
  - [x] lat
  - [x] long
  - [x] infant mortality_rt
  - [x] birth_rt
  - [x] ~ag_land_pct~
      * we can drop this because we have data to compute a new column ourselves
  - [x] physicians per thousand
  - [x] fertility rt
  - [x] primary education enrollment_pct
  - [x] life expectancy
  - [x] secondary_education_enrollment_pct
  - [x] currency_code
  - [x] consuer_price_index
  - [x] unemployment_rt
  - [x] tax_revenue_pct
  - [ ] official language

In [7]:
# function for nulls, returns a dataframe with nulls
def df_nulls(df):
    null_counts=country_df.isna().sum()
    null_percentages=round((df.isna().sum()/df.shape[0])*100,2)

    # data frame for results
    nulls_df=pd.DataFrame({
        'Nulls':null_counts,
        'Nulls (%)':null_percentages
    })
    
    # display
    print("Country Data Nulls")
    display(nulls_df.sort_values(by='Nulls',ascending=False))

df_nulls(country_df)

Country Data Nulls

                                    Nulls  Nulls (%)
tax_revenue_pct                        22      11.96
unemployment_rt                        15       8.15
consumer_price_index                   13       7.07
currency_code                          13       7.07
secondary_education_enrollment_pct      9       4.89
life_expectancy                         5       2.72
official_language                       5       2.72
primary_education_enrollment_pct        4       2.17
fertility_rt                            4       2.17
physicians_per_thousand                 4       2.17
ag_land_pct                             4       2.17
infant_mortality_rt                     3       1.63
birth_rt                                3       1.63
long                                    1       0.54
lat                                     1       0.54
covid_deaths                            0       0.00
total_area_km2                          0       0.00
continent                               0       0.00
covid_cases                             0       0.00
country                                 0       0.00
country_edited                          0       0.00
gross_domestic_product_usd(b)           0       0.00
land_area_km2                           0       0.00
average_population                      0       0.00

In [8]:
# function for displaying all nulls in a column
def find_nulls(df,column):
    return df[df[column].isnull()][['country_edited',column]]

def null_list(df,column):
    return df[df[column].isnull()]['country_edited'].tolist()
    
# function to display column format
def col_format(df,col):
    format_list=df[col].unique()
    return format_list[0:5]

---
**latitude**

In [10]:
# find countrys with null
find_nulls(country_df,'lat')

            country_edited  lat
141  Sao Tome and Principe  NaN

In [11]:
# find format
col_format(country_df,'lat')

array([ 33.93911 ,  41.153332,  28.033886,  42.506285, -11.202692])

**latitude found on [GPS Coordinates](https://gps-coordinates.org/sao-tome-and-principe-latitude.php)**
- 0.203237

In [13]:
# impute
country_df.loc[country_df['country_edited'] == 'Sao Tome and Principe', 'lat'] = 0.203237

# review
find_nulls(country_df,'lat')

Empty DataFrame
Columns: [country_edited, lat]
Index: []

---
**longitude**

In [15]:
# find countrys with null
find_nulls(country_df,'long')

            country_edited  long
141  Sao Tome and Principe   NaN

**longitude found on [GPS Coordinates](https://gps-coordinates.org/sao-tome-and-principe-latitude.php)**
- 6.608357

In [17]:
# impute
country_df.loc[country_df['country_edited'] == 'Sao Tome and Principe', 'long'] = 6.608357

# review
find_nulls(country_df,'long')

Empty DataFrame
Columns: [country_edited, long]
Index: []

---
**infant mortality rate found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/infant-mortality-rate/country-comparison/)**

In [19]:
# find nulls
find_nulls(country_df,'infant_mortality_rt')

    country_edited  infant_mortality_rt
53        Eswatini                  NaN
94   Liechtenstein                  NaN
116          Nauru                  NaN

In [20]:
# get current format
col_format(country_df,'infant_mortality_rt')

array([47.9,  7.8, 20.1,  2.7, 51.6])

In [21]:
# define infant morality rates
impute_mortality_rts={
    'Eswatini':36.7,
    'Liechtenstein':3.9,
    'Nauru':7.6
}

# impute
for country,rt in impute_mortality_rts.items():
    country_df.loc[country_df['country_edited']==country,'infant_mortality_rt']=rt

# review
find_nulls(country_df,'infant_mortality_rt')

Empty DataFrame
Columns: [country_edited, infant_mortality_rt]
Index: []

---
**birth rate found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/birth-rate/country-comparison/)**

In [23]:
# find nulls
find_nulls(country_df,'birth_rt')

    country_edited  birth_rt
53        Eswatini       NaN
116          Nauru       NaN
170         Tuvalu       NaN

In [24]:
# get format
col_format(country_df,'birth_rt')

array([32.49, 11.78, 24.28,  7.2 , 40.73])

In [25]:
# define rates
impute_birth_rts={
    'Eswatini':22.3,
    'Nauru':20.2,
    'Tuvalu':22
}

# impute
for country,rt in impute_birth_rts.items():
    country_df.loc[country_df['country_edited']==country,'birth_rt']=rt

# review
find_nulls(country_df,'birth_rt')

Empty DataFrame
Columns: [country_edited, birth_rt]
Index: []

---
**fertility rate found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/total-fertility-rate/country-comparison/)**

In [27]:
# find nulls
find_nulls(country_df,'fertility_rt')

    country_edited  fertility_rt
53        Eswatini           NaN
109         Monaco           NaN
116          Nauru           NaN
170         Tuvalu           NaN

In [28]:
# get format
col_format(country_df,'fertility_rt')

array([4.47, 1.62, 3.02, 1.27, 5.52])

In [29]:
# define rates
impute_fertility_rts={
    'Eswatini':2.37,
    'Monaco':1.54,
    'Nauru':2.55,
    'Tuvalu':2.78
}

# impute
for country,rt in impute_fertility_rts.items():
    country_df.loc[country_df['country_edited']==country,'fertility_rt']=rt

# review
find_nulls(country_df,'fertility_rt')

Empty DataFrame
Columns: [country_edited, fertility_rt]
Index: []

---
**unemployment rate found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/unemployment-rate/country-comparison/)**

In [31]:
# find nulls
find_nulls(country_df,'unemployment_rt')

          country_edited  unemployment_rt
3                Andorra              NaN
5    Antigua and Barbuda              NaN
45              Dominica              NaN
53              Eswatini              NaN
64               Grenada              NaN
85              Kiribati              NaN
94         Liechtenstein              NaN
103     Marshall Islands              NaN
107           Micronesia              NaN
109               Monaco              NaN
116                Nauru              NaN
125                Palau              NaN
140           San Marino              NaN
145           Seychelles              NaN
170               Tuvalu              NaN

In [32]:
# get format
col_format(country_df,'unemployment_rt')

array([11.12, 12.33, 11.7 ,   nan,  6.89])

In [33]:
# dictionary
impute_ue_rts={
    'Andorra': 3.7,
    'Antigua and Barbuda': 11,
    'Dominica': 11,
    'Eswatini': 37.64,
    'Grenada': 24,
    'Kiribati': 8.6,
    'Liechtenstein': 2.4,
    'Marshall Islands': 9.8,
    'Micronesia': 8.9, 
    'Monaco': 6.3,
    'Nauru': 5.1,
    'Palau': 1.7, 
    'San Marino': 8.1, 
    'Seychelles': 3, 
    'Tuvalu': 11
}

# impute
for country,rt in impute_ue_rts.items():
    country_df.loc[country_df['country_edited']==country,'unemployment_rt']=rt

# review
find_nulls(country_df,'unemployment_rt')

Empty DataFrame
Columns: [country_edited, unemployment_rt]
Index: []

---
**tax revenue percentage found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/taxes-and-other-revenues/)**

In [35]:
# find nulls
find_nulls(country_df,'tax_revenue_pct')

    country_edited  tax_revenue_pct
3          Andorra              NaN
24          Brunei              NaN
33            Chad              NaN
37         Comoros              NaN
40            Cuba              NaN
44        Djibouti              NaN
47         Ecuador              NaN
51         Eritrea              NaN
68          Guyana              NaN
69           Haiti              NaN
93           Libya              NaN
94   Liechtenstein              NaN
104     Mauritania              NaN
109         Monaco              NaN
111     Montenegro              NaN
116          Nauru              NaN
126         Panama              NaN
153    South Sudan              NaN
169   Turkmenistan              NaN
170         Tuvalu              NaN
179      Venezuela              NaN
181          Yemen              NaN

In [36]:
# null list
null_list(country_df,'tax_revenue_pct')

['Andorra',
 'Brunei',
 'Chad',
 'Comoros',
 'Cuba',
 'Djibouti',
 'Ecuador',
 'Eritrea',
 'Guyana',
 'Haiti',
 'Libya',
 'Liechtenstein',
 'Mauritania',
 'Monaco',
 'Montenegro',
 'Nauru',
 'Panama',
 'South Sudan',
 'Turkmenistan',
 'Tuvalu',
 'Venezuela',
 'Yemen']

In [37]:
# get format
col_format(country_df,'tax_revenue_pct')

array([ 9.3, 18.6, 37.2,  nan,  9.2])

In [38]:
# define tax revenues
impute_tax_revenue_percentages={
    'Andorra': 69,
    'Brunei': 18.5,
    'Chad': 13.08,
    'Comoros': 14.22,
    'Cuba': 58.1,
    'Djibouti': 18.95,
    'Ecuador': 13.0,
    'Eritrea': 34.9,
    'Guyana': 15.37,
    'Haiti': 6.24,
    'Libya': 51.6,
    'Liechtenstein': 52.3,
    'Mauritania': 27.4,
    'Monaco': 14.4,
    'Montenegro': 37.2,
    'Nauru': 44.3,
    'Panama': 7.5,
    'South Sudan': 8.5,
    'Turkmenistan': 14.9,
    'Tuvalu': 18.5,
    'Venezuela': 5.96,
    'Yemen': 9.58
    }

# impute
for country,pct in impute_tax_revenue_percentages.items():
    country_df.loc[country_df['country_edited']==country,'tax_revenue_pct']=pct

# review
find_nulls(country_df,'tax_revenue_pct')

Empty DataFrame
Columns: [country_edited, tax_revenue_pct]
Index: []

---
**life expectancy found on [CIA World Factbook](https://www.cia.gov/the-world-factbook/field/life-expectancy-at-birth/country-comparison/)**

In [40]:
# find nulls
find_nulls(country_df,'life_expectancy')

    country_edited  life_expectancy
3          Andorra              NaN
53        Eswatini              NaN
109         Monaco              NaN
116          Nauru              NaN
170         Tuvalu              NaN

In [41]:
# list of countries
null_list(country_df,'life_expectancy')

['Andorra', 'Eswatini', 'Monaco', 'Nauru', 'Tuvalu']

In [42]:
# get format
col_format(country_df,'life_expectancy')

array([64.5, 78.5, 76.7,  nan, 60.8])

In [43]:
# define list to impute
impute_life_expectancies={
    'Andorra':83.8,
    'Eswatini':60.7,
    'Monaco':89.8,
    'Nauru':68.6,
    'Tuvalu':69
}

# impute
for country,expectancy in impute_life_expectancies.items():
    country_df.loc[country_df['country_edited']==country,'life_expectancy']=expectancy

# review
find_nulls(country_df,'life_expectancy')

Empty DataFrame
Columns: [country_edited, life_expectancy]
Index: []

---
**consumper price index found information could not be found for null countries**
* impute with median

In [45]:
# find nulls
find_nulls(country_df,'consumer_price_index')

       country_edited  consumer_price_index
3             Andorra                   NaN
15            Belarus                   NaN
40               Cuba                   NaN
51            Eritrea                   NaN
53           Eswatini                   NaN
94      Liechtenstein                   NaN
103  Marshall Islands                   NaN
109            Monaco                   NaN
116             Nauru                   NaN
151           Somalia                   NaN
169      Turkmenistan                   NaN
170            Tuvalu                   NaN
177        Uzbekistan                   NaN

In [46]:
# define  median cpi
median_cpi=country_df['consumer_price_index'].median()
    
median_cpi

125.71

In [47]:
# impute
country_df['consumer_price_index']=country_df['consumer_price_index'].fillna(median_cpi)

# review
find_nulls(country_df,'consumer_price_index')

Empty DataFrame
Columns: [country_edited, consumer_price_index]
Index: []

---
**physicians per thousand found on [CIA World Factbook](country_df,'physicians_per_thousand')**

In [49]:
# find nulls
find_nulls(country_df,'physicians_per_thousand')

    country_edited  physicians_per_thousand
53        Eswatini                      NaN
94   Liechtenstein                      NaN
116          Nauru                      NaN
153    South Sudan                      NaN

In [50]:
# list of nulls
null_list(country_df,'physicians_per_thousand')

['Eswatini', 'Liechtenstein', 'Nauru', 'South Sudan']

In [51]:
# get format
col_format(country_df,'physicians_per_thousand')

array([0.28, 1.2 , 1.72, 3.33, 0.21])

In [52]:
# define dictionary to impute
impute_phys_per_thousand={
    'Eswatini':0.14,
    'Liechtenstein':2.5,
    'Nauru':1.35,
    'South Sudan':0.04
}

# impute
for country,stat in impute_phys_per_thousand.items():
    country_df.loc[country_df['country_edited']==country,'physicians_per_thousand']=stat

# review
find_nulls(country_df,'physicians_per_thousand')

Empty DataFrame
Columns: [country_edited, physicians_per_thousand]
Index: []

---
**primary education enrollment percentage found on [Our World in Data](https://ourworldindata.org/grapher/total-net-enrollment-rate-in-primary-education?tab=table&time=2021..latest)**

In [54]:
# find nulls
find_nulls(country_df,'primary_education_enrollment_pct')

             country_edited  primary_education_enrollment_pct
21   Bosnia and Herzegovina                               NaN
53                 Eswatini                               NaN
109                  Monaco                               NaN
116                   Nauru                               NaN

In [55]:
# list
null_list(country_df,'primary_education_enrollment_pct')

['Bosnia and Herzegovina', 'Eswatini', 'Monaco', 'Nauru']

In [56]:
# format
col_format(country_df,'primary_education_enrollment_pct')

array([104. , 107. , 109.9, 106.4, 113.5])

In [57]:
# define dictionary to impute
prim_enrollment_pct={
    'Bosnia and Herzegovina':84.4,
    'Eswatini':89.5,
    'Monaco':97.9,
    'Nauru':96.3
}

# impute
for country,pct in prim_enrollment_pct.items():
    country_df.loc[country_df['country_edited']==country,'primary_education_enrollment_pct']=pct

# review
find_nulls(country_df,'primary_education_enrollment_pct')

Empty DataFrame
Columns: [country_edited, primary_education_enrollment_pct]
Index: []

---
**secondary education enrollment percentage found on [Our World in Data](https://ourworldindata.org/grapher/total-net-enrollment-rate-in-primary-education?tab=table&time=2021..latest)**

In [59]:
# find nulls
find_nulls(country_df,'secondary_education_enrollment_pct')

      country_edited  secondary_education_enrollment_pct
3            Andorra                                 NaN
20           Bolivia                                 NaN
53          Eswatini                                 NaN
85          Kiribati                                 NaN
109           Monaco                                 NaN
116            Nauru                                 NaN
150  Solomon Islands                                 NaN
153      South Sudan                                 NaN
170           Tuvalu                                 NaN

In [60]:
# get list
null_list(country_df,'secondary_education_enrollment_pct')

['Andorra',
 'Bolivia',
 'Eswatini',
 'Kiribati',
 'Monaco',
 'Nauru',
 'Solomon Islands',
 'South Sudan',
 'Tuvalu']

In [61]:
# define dictionary to impute
impute_secd_enrollment_pct={
    'Andorra':97.5,
    'Bolivia':91.5,
    'Eswatini':86,
    'Kiribati':81.6,
    'Monaco':154.2,
    'Nauru':86.4,
    'Solomon Islands':48.3,
    'South Sudan':11.2,
    'Tuvalu':91.3
}

# impute
for country,pct in impute_secd_enrollment_pct.items():
    country_df.loc[country_df['country_edited']==country,'secondary_education_enrollment_pct']=pct

# review
find_nulls(country_df,'secondary_education_enrollment_pct')

Empty DataFrame
Columns: [country_edited, secondary_education_enrollment_pct]
Index: []

---
**currency codes found on [IBAN Currency Codes](https://www.iban.com/currency-codes)**

In [63]:
# find nulls
find_nulls(country_df,'currency_code')

               country_edited currency_code
11                    Bahamas           NaN
19                     Bhutan           NaN
29                   Cambodia           NaN
32   Central African Republic           NaN
49                El Salvador           NaN
53                   Eswatini           NaN
81                      Japan           NaN
91                    Lesotho           NaN
92                    Liberia           NaN
100                  Maldives           NaN
115                   Namibia           NaN
126                    Panama           NaN
183                  Zimbabwe           NaN

In [64]:
# get list
null_list(country_df,'currency_code')

['Bahamas',
 'Bhutan',
 'Cambodia',
 'Central African Republic',
 'El Salvador',
 'Eswatini',
 'Japan',
 'Lesotho',
 'Liberia',
 'Maldives',
 'Namibia',
 'Panama',
 'Zimbabwe']

In [65]:
# get format
col_format(country_df,'currency_code')

array(['AFN', 'ALL', 'DZD', 'EUR', 'AOA'], dtype=object)

In [66]:
# define dictionary to impute
impute_currency_codes={
    'Bahamas':'BSD',
    'Bhutan':'BTN',
    'Cambodia':'KHR',
    'Central African Republic':'XAF',
    'El Salvador':'USD',
    'Eswatini':'SZL',
    'Japan':'JPY',
    'Lesotho':'LSL',
    'Liberia':'LRD',
    'Maldives':'MVR',
    'Namibia':'NAD',
    'Panama':'PAB',
    'Zimbabwe':'ZWL'
}

# impute
for country,code in impute_currency_codes.items():
    country_df.loc[country_df['country_edited']==country,'currency_code']=code

# review
find_nulls(country_df,'currency_code')

Empty DataFrame
Columns: [country_edited, currency_code]
Index: []

---
**official languages found on [Wikipedia](https://en.wikipedia.org/wiki/List_of_official_languages_by_country_and_territory)**
- if country has none listed, use language that had de facto status

In [68]:
# find nulls
find_nulls(country_df,'official_language')

            country_edited official_language
8                Australia               NaN
81                   Japan               NaN
106                 Mexico               NaN
141  Sao Tome and Principe               NaN
175          United States               NaN

In [69]:
# get format
col_format(country_df,'official_language')

array(['Pashto', 'Albanian', 'Arabic', 'Catalan', 'Portuguese'],
      dtype=object)

In [70]:
# get list
null_list(country_df,'official_language')

['Australia', 'Japan', 'Mexico', 'Sao Tome and Principe', 'United States']

In [71]:
# define dictionary to impute
impute_lanugages={
    'Australia':'English',
    'Japan':'Japanese',
    'Mexico':'Spanish',
    'Sao Tome and Principe':'Portuguese',
    'United States':'English'
}

# impute
for country,language in impute_lanugages.items():
    country_df.loc[country_df['country_edited']==country,'official_language']=language

# review
find_nulls(country_df,'official_language')

Empty DataFrame
Columns: [country_edited, official_language]
Index: []

---
**drop ag_land_pct**

In [73]:
country_df=country_df.drop(columns='ag_land_pct')

---
**check nulls before saving**

In [75]:
df_nulls(country_df)

Country Data Nulls

                                    Nulls  Nulls (%)
country                                 0        0.0
gross_domestic_product_usd(b)           0        0.0
total_area_km2                          0        0.0
covid_deaths                            0        0.0
covid_cases                             0        0.0
continent                               0        0.0
country_edited                          0        0.0
unemployment_rt                         0        0.0
tax_revenue_pct                         0        0.0
secondary_education_enrollment_pct      0        0.0
primary_education_enrollment_pct        0        0.0
consumer_price_index                    0        0.0
birth_rt                                0        0.0
land_area_km2                           0        0.0
long                                    0        0.0
lat                                     0        0.0
physicians_per_thousand                 0        0.0
official_language                       0        0.0
life_expectancy                         0        0.0
infant_mortality_rt                     0        0.0
fertility_rt                            0        0.0
currency_code                           0        0.0
average_population                      0        0.0

---
### Save Data
* **new csv file name**

In [77]:
# save csv file
country_df.to_csv('06_country_merged_imputed.csv',sep=',',encoding='utf-8',index=False)